Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/svd/PIC32CX2051MTSH128S1.svd
            <register>
               <name>EOC_IMR</name>
               <description>End Of Conversion Interrupt Mask Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EOC0</name>
                     <description>End of Conversion Interrupt Mask 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC1</name>
                     <description>End of Conversion Interrupt Mask 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC2</name>
                     <description>End of Conversion Interrupt Mask 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC3</name>
                     <description>End of Conversion Interrupt Mask 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC4</name>
                     <description>End of Conversion Interrupt Mask 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC5</name>
                     <description>End of Conversion Interrupt Mask 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC6</name>
                     <description>End of Conversion Interrupt Mask 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC7</name>
                     <description>End of Conversion Interrupt Mask 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EOC_ISR</name>
               <description>End Of Conversion Interrupt Status Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EOC0</name>
                     <description>End of Conversion 0 (automatically set / cleared)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC1</name>
                     <description>End of Conversion 1 (automatically set / cleared)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC2</name>
                     <description>End of Conversion 2 (automatically set / cleared)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC3</name>
                     <description>End of Conversion 3 (automatically set / cleared)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC4</name>
                     <description>End of Conversion 4 (automatically set / cleared)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC5</name>
                     <description>End of Conversion 5 (automatically set / cleared)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC6</name>
                     <description>End of Conversion 6 (automatically set / cleared)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC7</name>
                     <description>End of Conversion 7 (automatically set / cleared)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPMR</name>
               <description>Temperature Sensor Mode Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TEMPON</name>
                     <description>Temperature Sensor On</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEMPCMPMOD</name>
                     <description>Temperature Comparison Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TEMPCMPMODSelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Generates the TEMPCHG flag in ADC_ISR when the converted data is lower than the low threshold of the window.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Generates the TEMPCHG flag in ADC_ISR when the converted data is higher than the high threshold of the window.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IN</name>
                           <description>Generates the TEMPCHG flag in ADC_ISR when the converted data is in the comparison window.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUT</name>
                           <description>Generates the TEMPCHG flag in ADC_ISR when the converted data is out of the comparison window.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPCWR</name>
               <description>Temperature Compare Window Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TLOWTHRES</name>
                     <description>Temperature Low Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>THIGHTHRES</name>
                     <description>Temperature High Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVER</name>
               <description>Overrun Status Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OVRE0</name>
                     <description>Overrun Error 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE1</name>
                     <description>Overrun Error 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE2</name>
                     <description>Overrun Error 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE3</name>
                     <description>Overrun Error 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE4</name>
                     <description>Overrun Error 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE5</name>
                     <description>Overrun Error 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE6</name>
                     <description>Overrun Error 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE7</name>
                     <description>Overrun Error 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMR</name>
               <description>Extended Mode Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CMPMODE</name>
                     <description>Comparison Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMPMODESelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>When the converted data is lower than the low threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wake-up mode, defines the conditions to exit the system from Wait mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>When the converted data is higher than the high threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wake-up mode, defines the conditions to exit the system from Wait mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IN</name>
                           <description>When the converted data is in the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wake-up mode, defines the conditions to exit the system from Wait mode.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUT</name>
                           <description>When the converted data is out of the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wake-up mode, defines the conditions to exit the system from Wait mode.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMPTYPE</name>
                     <description>Comparison Type</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMPTYPESelect</name>
                        <enumeratedValue>
                           <name>FLAG_ONLY</name>
                           <description>Any conversion is performed and comparison function drives the COMPE flag.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START_CONDITION</name>
                           <description>Comparison conditions must be met to start the storage of all conversions until ADC_CR.CMPRST is set.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMPSEL</name>
                     <description>Comparison Selected Channel</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CMPALL</name>
                     <description>Compare All Channels</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPFILTER</name>
                     <description>Compare Event Filtering</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSR</name>
                     <description>Over Sampling Rate</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OSRSelect</name>
                        <enumeratedValue>
                           <name>NO_AVERAGE</name>
                           <description>No averaging. ADC sample rate is maximum.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR4</name>
                           <description>1-bit enhanced resolution by averaging. ADC sample rate divided by 4.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR16</name>
                           <description>2-bit enhanced resolution by averaging. ADC sample rate divided by 16.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR64</name>
                           <description>1-bit enhanced resolution by averaging. ADC sample rate divided by 64</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR256</name>
                           <description>2-bit enhanced resolution by averaging. ADC sample rate divided by 256.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASTE</name>
                     <description>Averaging on Single Trigger Event</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASTESelect</name>
                        <enumeratedValue>
                           <name>MULTI_TRIG_AVERAGE</name>
                           <description>The average requests several trigger events.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE_TRIG_AVERAGE</name>
                           <description>The average requests only one trigger event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRCCLK</name>
                     <description>External Clock Selection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRCCLKSelect</name>
                        <enumeratedValue>
                           <name>PERIPH_CLK</name>
                           <description>The peripheral clock is the source for the ADC prescaler.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK</name>
                           <description>GCLK is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRACKX</name>
                     <description>Tracking Time x4, x8 or x16</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TRACKXSelect</name>
                        <enumeratedValue>
                           <name>TRACKTIMX1</name>
                           <description>ADC_MR.TRACKTIM effect is multiplied by 1.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRACKTIMX4</name>
                           <description>ADC_MR.TRACKTIM effect is multiplied by 4.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRACKTIMX8</name>
                           <description>ADC_MR.TRACKTIM effect is multiplied by 8</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRACKTIMX16</name>
                           <description>ADC_MR.TRACKTIM effect is multiplied by 16.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAG</name>
                     <description>ADC_LCDR Tag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIGNMODE</name>
                     <description>Sign Mode</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SIGNMODESelect</name>
                        <enumeratedValue>
                           <name>SE_UNSG_DF_SIGN</name>
                           <description>Single-ended channels: unsigned conversions Differential channels: signed conversions</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SE_SIGN_DF_UNSG</name>
                           <description>Single-ended channels: signed conversions Differential channels: unsigned conversions</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALL_UNSIGNED</name>
                           <description>All channels: unsigned conversions</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALL_SIGNED</name>
                           <description>All channels: signed conversions</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCMODE</name>
                     <description>ADC Running Mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ADCMODESelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal mode of operation.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFFSET_ERROR</name>
                           <description>Offset Error mode to measure the offset error. See Table 6-6 'ADC Running Modes'.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN_ERROR_HIGH</name>
                           <description>Gain Error mode to measure the gain error. See Table 6-6 'ADC Running Modes'.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN_ERROR_LOW</name>
                           <description>Gain Error mode to measure the gain error. See Table 6-6 'ADC Running Modes'.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
