Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/svd/PIC32CX2051MTSH128S1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>EMAFE</name>
         <version>04742C</version>
         <description>Energy Metering Analog Front End</description>
         <baseAddress>0x48000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x12C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>EMAFE_SLINK</name>
            <value>76</value>
         </interrupt>
         <interrupt>
            <name>EMAFE_DATA</name>
            <value>77</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST_DECIM</name>
                     <description>Sinc Decimation Filters Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPF_ON0</name>
                     <description>Low-Pass Filter 0 On</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPF_ON1</name>
                     <description>Low-Pass Filter 1 On</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPF_ON2</name>
                     <description>Low-Pass Filter 2 On</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPF_ON3</name>
                     <description>Low-Pass Filter 3 On</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPF_ON4</name>
                     <description>Low-Pass Filter 4 On</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_ON</name>
                     <description>Direct Memory Access On</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMACH0</name>
                     <description>Channel 0 Enable for DMA transfer</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMACH1</name>
                     <description>Channel 1 Enable for DMA transfer</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMACH2</name>
                     <description>Channel 2 Enable for DMA transfer</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMACH3</name>
                     <description>Channel 3 Enable for DMA transfer</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMACH4</name>
                     <description>Channel 4 Enable for DMA transfer</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VAR_ON</name>
                     <description>Variation Detection On</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VAR_CH</name>
                     <description>Variation Detection Channel Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>VAR_CHSelect</name>
                        <enumeratedValue>
                           <name>CH0</name>
                           <description>Channel 0 is selected.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH1</name>
                           <description>Channel 1 is selected.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH2</name>
                           <description>Channel 2 is selected.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH3</name>
                           <description>Channel 3 is selected.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH4</name>
                           <description>Channel 4 is selected.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH5</name>
                           <description>Channel 5 is selected.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH6</name>
                           <description>Channel 6 is selected.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VAR_LIMIT</name>
                     <description>Variation Detection Limit for Event Triggering</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CDCR</name>
               <description>Channels Difference Comparison Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CHA_IDX</name>
                     <description>First Channel to Compare</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CHA_IDXSelect</name>
                        <enumeratedValue>
                           <name>CH0</name>
                           <description>Channel 0 is used to perform comparison.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH1</name>
                           <description>Channel 1 is used to perform comparison.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH2</name>
                           <description>Channel 2 is used to perform comparison.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH3</name>
                           <description>Channel 3 is used to perform comparison.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH4</name>
                           <description>Channel 4 is used to perform comparison.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH5</name>
                           <description>Channel 5 is used to perform comparison.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH6</name>
                           <description>Channel 6 is used to perform comparison.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHB_IDX</name>
                     <description>Second Channel to Compare</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CHB_IDXSelect</name>
                        <enumeratedValue>
                           <name>CH0</name>
                           <description>Channel 0 is used to perform comparison</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH1</name>
                           <description>Channel 1 is used to perform comparison</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH2</name>
                           <description>Channel 2 is used to perform comparison</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH3</name>
                           <description>Channel 3 is used to perform comparison</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH4</name>
                           <description>Channel 4 is used to perform comparison</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH5</name>
                           <description>Channel 5 is used to perform comparison.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CH6</name>
                           <description>Channel 6 is used to perform comparison.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFFTYPE</name>
                     <description>Type of Comparison</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFFCOUNT</name>
                     <description>Successive Comparison Event Count</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DIFFTHRES</name>
                     <description>Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMR</name>
               <description>Extended Mode Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FORMAT</name>
                     <description>Data Format</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FORMATSelect</name>
                        <enumeratedValue>
                           <name>NB_CHANNEL</name>
                           <description>Index of channel is added in register EMAFE_DMA_DATA. 24-bit dynamic range. (default).</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIGNEXTEND</name>
                           <description>24-bit value with sign extension up to 32-bit applied to registers EMAFE_DMA_DATA and EMAFE _DATAx. 24-bit dynamic range</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULLRANGE</name>
                           <description>32-bit full range signed extension is applied in EMAFE_DMA_DATA and EMAFE _DATAx. 32-bit dynamic range.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCLKDIV_LPF</name>
                     <description>LPF Clock Prescaler Ratio</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MCLKDIV_LPFSelect</name>
                        <enumeratedValue>
                           <name>MCLK</name>
                           <description>LPFIF clock is MCLK/1.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCLKDIV2</name>
                           <description>LPFIF clock is MCLK/2.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCLKDIV4</name>
                           <description>LPFIF clock is MCLK/4.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCLKDIV8</name>
                           <description>LPFIF clock is MCLK/8. (Default)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCLKDIV16</name>
                           <description>LPFIF clock is MCLK/16.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCLKDIV32</name>
                           <description>LPFIF clock is MCLK/32.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSR</name>
                     <description>OSR of the Decimation Filters</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OSRSelect</name>
                        <enumeratedValue>
                           <name>OSR8</name>
                           <description>OSR of the system is 8.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR16</name>
                           <description>OSR of the system is 16.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR32</name>
                           <description>OSR of the system is 32.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR64</name>
                           <description>OSR of the system is 64 (Default).</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_DATA_CH_INDEX_24BIT_DATA_MODE</name>
               <description>DMA Data Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA24</name>
                     <description>24-bit Data read by DMA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>CHIDX</name>
                     <description>Channel Index</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_DATA_ONLY_32BIT_DATA_SE24BIT_MODE</name>
               <description>DMA Data Register</description>
               <alternateRegister>DMA_DATA_CH_INDEX_24BIT_DATA_MODE</alternateRegister>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA24SE</name>
                     <description>Low-pass Filter 24-bit Data with 32-bit Sign Extension read by DMA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA_DATA_ONLY_32BIT_DATA_MODE</name>
               <description>DMA Data Register</description>
               <alternateRegister>DMA_DATA_CH_INDEX_24BIT_DATA_MODE</alternateRegister>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA32</name>
                     <description>32-bit Data read by DMA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>DATA_DATA_24BIT_MODE[%s]</name>
               <description>Data Channel 0 Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA24</name>
                     <description>Low-pass Filter 24-bit Signed Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>DATA_SE_24BIT_DATA_MODE[%s]</name>
               <description>Data Channel 0 Register</description>
               <alternateRegister>DATA_DATA_24BIT_MODE[%s]</alternateRegister>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA24SE</name>
                     <description>Low-pass Filter 24-bit Data with 32-bit Sign Extension</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>DATA_DATA_32BIT_MODE[%s]</name>
               <description>Data Channel 0 Register</description>
               <alternateRegister>DATA_DATA_24BIT_MODE[%s]</alternateRegister>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA32</name>
                     <description>Low-pass Filter 32-bit Signed Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
