Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/svd/PIC32CX2051MTSH128S1.svd
            <register>
               <name>HCACHED_DATA</name>
               <description>HCACHED Data Memory Configuration Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RM</name>
                     <description>Read Margin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RME</name>
                     <description>Read Margin Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LS</name>
                     <description>Light Sleep Mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>Deep Sleep Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SD</name>
                     <description>Shutdown Mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCACHED_TAG</name>
               <description>HCACHEDTag Memory Configuration Register</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RM</name>
                     <description>Read Margin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RME</name>
                     <description>Read Margin Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LS</name>
                     <description>Light Sleep Mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>Deep Sleep Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SD</name>
                     <description>Shutdown Mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH</name>
               <description>Flash Memory Configuration Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PATCH_BYPASS</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPT_LINK</name>
               <description>Optical Link Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLK_SELECT</name>
                     <description>Clock Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JTAG</name>
               <description>JTAG Register</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>JTAG_LOCK</name>
                     <description>JTAG Lock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CORE_DEBUG_CFG</name>
               <description>Core Debug Configuration Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SWV</name>
                     <description>SWV Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTRG1</name>
                     <description>From Core 1 to Core 0 Cross Triggering</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTRG0</name>
                     <description>From Core 0 to Core 1 Cross Triggering</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMAHB2AHB</name>
               <description>AHB2AHB Configuration Register</description>
               <addressOffset>0xA4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PFETCH8_0_1</name>
                     <description>AHB MASTER0_1 Converter Prefetch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PFETCH8_0_1Select</name>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>INCR undefined burst converted to burst of 4 data.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>INCR undefined burst converted to burst of 8 data.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFETCH8_1_0</name>
                     <description>AHB MASTER1_0 Converter Prefetch</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PFETCH8_1_0Select</name>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>INCR undefined burst converted to burst of 4 data.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>INCR undefined burst converted to burst of 8 data.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECURE</name>
               <description>Secure Register</description>
               <addressOffset>0xA8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ROM_ENA</name>
                     <description>ROM Access Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECURE_BIT</name>
               <description>Secure Bit Register</description>
               <addressOffset>0xAC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MODE_DIS</name>
                     <description>Secure Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERASE_FLASH_SRAM</name>
               <description>Erase Flash/SRAM Register</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HW_ERASE</name>
                     <description>PB2/Peripherals or Hardware Erase Signal Assignment</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HW_ERASESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Hardware erase signal disabled. PB2 pin can be used in GPIO or Peripheral IO mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Hardware erase signal enabled. PB2 pin is assigned to Flash erase function.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAM0</name>
                     <description>Erase SRAM0 Content</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRAM0Select</name>
                        <enumeratedValue>
                           <name>NOT_DELETED</name>
                           <description>If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is not deleted.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DELETED</name>
                           <description>If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is deleted.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_DEBUG</name>
               <description>PWM Debug Register</description>
               <addressOffset>0xB4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CORE0</name>
                     <description>Debug Information Propagation Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CORE0Select</name>
                        <enumeratedValue>
                           <name>NOT_SENT</name>
                           <description>Core x does not send the debug signal to the PWM.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENT</name>
                           <description>Core x sends the debug signal to PWM. Refer to 'Debug Mode' in the section 'Pulse Width Modulation Controller (PWM)' for details on configuring an action when the debug signal is active.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CORE1</name>
                     <description>Debug Information Propagation Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CORE1Select</name>
                        <enumeratedValue>
                           <name>NOT_SENT</name>
                           <description>Core x does not send the debug signal to the PWM.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENT</name>
                           <description>Core x sends the debug signal to PWM. Refer to 'Debug Mode' in the section 'Pulse Width Modulation Controller (PWM)' for details on configuring an action when the debug signal is active.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFPI</name>
               <description>FFPI Register</description>
               <addressOffset>0xB8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>FFPI Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAIT_MODE</name>
               <description>Improved Wait Mode Register</description>
               <addressOffset>0xBC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CONTROL</name>
                     <description>Improved Wait Mode Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ROM_CODE</name>
               <description>ROM Code Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PLLA_STATUS</name>
                     <description>PLLA Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FORCE_BYPASS</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCE_BYPASS_VALUE</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x534652</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPSRC</name>
                     <description>Write Protection Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPARE</name>
               <description>Spare Register</description>
               <addressOffset>0xF0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Spare</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERSION</name>
               <description>Version Register</description>
               <addressOffset>0xFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>VERSION</name>
                     <description>Version of the Hardware Module</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>MFN</name>
                     <description>Metal Fix Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
