Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/svd/PIC32CX2051MTSH128S1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SLCDC</name>
         <version>6259K</version>
         <description>Segment LCD Controller</description>
         <baseAddress>0x40030000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x23C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SLCDC</name>
            <value>29</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>LCDEN</name>
                     <description>Enable the LCDC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCDDIS</name>
                     <description>Disable LCDC</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZDF</name>
                     <description>Freeze Display Panel Features Configuration</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZMAP</name>
                     <description>Freeze Remap Configuration</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZKEY</name>
                     <description>Freeze Key (write-only)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>FRZKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the FRZDF bit or FRZMAP bit. Always reads as 0.</description>
                           <value>0x4E</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>COMSEL</name>
                     <description>Selection of the Number of Commons</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>COMSELSelect</name>
                        <enumeratedValue>
                           <name>COM_0</name>
                           <description>COM0 is driven by SLCDC, COM1:7 are driven by digital function</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COM_0TO1</name>
                           <description>COM0:1 are driven by SLCDC, COM2:7 are driven by digital function</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COM_0TO2</name>
                           <description>COM0:2 are driven by SLCDC, COM3:7 are driven by digital function</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COM_0TO3</name>
                           <description>COM0:3 are driven by SLCDC, COM4:7 are driven by digital function</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COM_0TO4</name>
                           <description>COM0:4 are driven by SLCDC, COM5:7 are driven by digital function</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COM_0TO5</name>
                           <description>COM0:5 are driven by SLCDC, COM6:7 are driven by digital function</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COM_0TO6</name>
                           <description>COM0:6 are driven by SLCDC, COM7 driven by digital function</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COM_0TO7</name>
                           <description>COM0:7 are driven by SLCDC, no COM pin driven by digital function</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEGSEL</name>
                     <description>Selection of the Number of Segments</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>BUFTIME</name>
                     <description>Buffer On-Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>BUFTIMESelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Nominal drive time is 0% of SLCK period</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X2_SLCK_PERIOD</name>
                           <description>Nominal drive time is 2 periods of SLCK clock</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X4_SLCK_PERIOD</name>
                           <description>Nominal drive time is 4 periods of SLCK clock</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X8_SLCK_PERIOD</name>
                           <description>Nominal drive time is 8 periods of SLCK clock</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X16_SLCK_PERIOD</name>
                           <description>Nominal drive time is 16 periods of SLCK clock</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X32_SLCK_PERIOD</name>
                           <description>Nominal drive time is 32 periods of SLCK clock</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X64_SLCK_PERIOD</name>
                           <description>Nominal drive time is 64 periods of SLCK clock</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>X128_SLCK_PERIOD</name>
                           <description>Nominal drive time is 128 periods of SLCK clock</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERCENT_50</name>
                           <description>Nominal drive time is 50% of SLCK period</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERCENT_100</name>
                           <description>Nominal drive time is 100% of SLCK period</description>
                           <value>0x9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BIAS</name>
                     <description>LCD Display Configuration</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BIASSelect</name>
                        <enumeratedValue>
                           <name>STATIC</name>
                           <description>Static</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIAS_1_2</name>
                           <description>Bias 1/2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIAS_1_3</name>
                           <description>Bias 1/3</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIAS_1_4</name>
                           <description>Bias 1/4</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPMODE</name>
                     <description>Low-Power Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRR</name>
               <description>Frame Rate Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRESC</name>
                     <description>Clock Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PRESCSelect</name>
                        <enumeratedValue>
                           <name>SLCK_DIV8</name>
                           <description>Slow clock is divided by 8</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLCK_DIV16</name>
                           <description>Slow clock is divided by 16</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLCK_DIV32</name>
                           <description>Slow clock is divided by 32</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLCK_DIV64</name>
                           <description>Slow clock is divided by 64</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLCK_DIV128</name>
                           <description>Slow clock is divided by 128</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLCK_DIV256</name>
                           <description>Slow clock is divided by 256</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLCK_DIV512</name>
                           <description>Slow clock is divided by 512</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLCK_DIV1024</name>
                           <description>Slow clock is divided by 1024</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIV</name>
                     <description>Clock Division</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DIVSelect</name>
                        <enumeratedValue>
                           <name>PRESC_CLK_DIV1</name>
                           <description>Clock output from prescaler is divided by 1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESC_CLK_DIV2</name>
                           <description>Clock output from prescaler is divided by 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESC_CLK_DIV3</name>
                           <description>Clock output from prescaler is divided by 3</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESC_CLK_DIV4</name>
                           <description>Clock output from prescaler is divided by 4</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESC_CLK_DIV5</name>
                           <description>Clock output from prescaler is divided by 5</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESC_CLK_DIV6</name>
                           <description>Clock output from prescaler is divided by 6</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESC_CLK_DIV7</name>
                           <description>Clock output from prescaler is divided by 7</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRESC_CLK_DIV8</name>
                           <description>Clock output from prescaler is divided by 8</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DR</name>
               <description>Display Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DISPMODE</name>
                     <description>Display Mode Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DISPMODESelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal Mode-Latched data are displayed.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCE_OFF</name>
                           <description>Force Off Mode-All pixels are invisible. (The SLCDC memory is unchanged.)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCE_ON</name>
                           <description>Force On Mode-All pixels are visible. (The SLCDC memory is unchanged.)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BLINKING</name>
                           <description>Blinking Mode-All pixels are alternately turned off to the predefined state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Inverted Mode-All pixels are set in the inverted state as defined in SLCDC memory. (The SLCDC memory is unchanged.)</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED_BLINK</name>
                           <description>Inverted Blinking Mode-All pixels are alternately turned off to the predefined opposite state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER_BUFFER_LOAD</name>
                           <description>User Buffer Only Load Mode-Blocks the automatic transfer from User Buffer to Display Buffer.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BUFFERS_SWAP</name>
                           <description>Buffer Swap Mode-All pixels are alternatively assigned to the state defined in the User Buffer, then to the state defined in the Display Buffer at LCDBLKFREQ frequency.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LCDBLKFREQ</name>
                     <description>LCD Blinking Frequency Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable Status (Automatically Set/Reset)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFFRZS</name>
                     <description>Display Panel Features Configuration Freeze Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MAPFRZS</name>
                     <description>Remapping Configuration Freeze Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ENDFRAME</name>
                     <description>End of Frame Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS</name>
                     <description>Disable Completion Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ENDFRAME</name>
                     <description>End of Frame Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS</name>
                     <description>Disable Completion Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ENDFRAME</name>
                     <description>End of Frame Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS</name>
                     <description>Disable Completion Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
